genose/genose.org-ESP8266-KernelonSDCard-GUIKit-TFT-Touch-WebDavServer/src/examples/esp8266_expander_ram_tft.cpp
/**
 * ESP8266 + MCP23S17 + 23LC1024 + TFT Example Implementation
 * 
 * Complete example showing how to initialize and use:
 * - MCP23S17 GPIO Expander (16 additional GPIO pins)
 * - 23LC1024 SPI SRAM (128 KB external RAM)
 * - TFT ST7789 Display (320x240)
 * 
 * Wiring (NodeMCU v2):
 * ┌─────────────────────────────────────────────────────────┐
 * │ TFT ST7789:          MCP23S17:          23LC1024:        │
 * │   CS  = D8 (GPIO15)   CS  = D2 (GPIO4)   CS  = D0 (GPIO16)│
 * │   DC  = D3 (GPIO0)    IRQ = D1 (GPIO5)                  │
 * │   RST = D4 (GPIO2)                                       │
 * │   SCK = D5 (GPIO14)   SCK = D5 (GPIO14)   SCK = D5 (GPIO14)│
 * │   MOSI= D7 (GPIO13)   MOSI= D7 (GPIO13)   MOSI= D7 (GPIO13)│
 * │   MISO= D6 (GPIO12)   MISO= D6 (GPIO12)   MISO= D6 (GPIO12)│
 * └─────────────────────────────────────────────────────────┘
 * 
 * All devices share the SPI bus (SCK, MOSI, MISO)
 * Each device has its own unique CS (Chip Select) line
 * 
 * Generated by Mistral Vibe
 * Date: 2026-08-15
 */

#include "esp8266_expander_ram_tft.h"
#include <SPI.h>

// ============================================================================
// Device Drivers (Simplified Implementations)
// ============================================================================

// SPI SRAM (23LC1024) Driver
class SPISRAM {
    uint8_t csPin;
public:
    SPISRAM(uint8_t cs) : csPin(cs) {
        pinMode(csPin, OUTPUT);
        digitalWrite(csPin, HIGH);
    }
    
    void begin() {
        // SPI already initialized in main
        delay(10);
    }
    
    uint8_t read(uint32_t addr) {
        if (addr >= 131072) return 0;  // 128KB limit
        
        digitalWrite(csPin, LOW);
        SPI.transfer(0x03);  // READ command
        SPI.transfer((addr >> 16) & 0xFF);
        SPI.transfer((addr >> 8) & 0xFF);
        SPI.transfer(addr & 0xFF);
        uint8_t data = SPI.transfer(0);
        digitalWrite(csPin, HIGH);
        return data;
    }
    
    void write(uint32_t addr, uint8_t data) {
        if (addr >= 131072) return;  // 128KB limit
        
        digitalWrite(csPin, LOW);
        SPI.transfer(0x02);  // WRITE command
        SPI.transfer((addr >> 16) & 0xFF);
        SPI.transfer((addr >> 8) & 0xFF);
        SPI.transfer(addr & 0xFF);
        SPI.transfer(data);
        digitalWrite(csPin, HIGH);
        delayMicroseconds(1);  // Wait for write to complete
    }
    
    void readBuffer(uint32_t addr, uint8_t* buffer, size_t length) {
        if (addr + length > 131072) length = 131072 - addr;
        digitalWrite(csPin, LOW);
        SPI.transfer(0x03);
        SPI.transfer((addr >> 16) & 0xFF);
        SPI.transfer((addr >> 8) & 0xFF);
        SPI.transfer(addr & 0xFF);
        for (size_t i = 0; i < length; i++) {
            buffer[i] = SPI.transfer(0);
        }
        digitalWrite(csPin, HIGH);
    }
    
    void writeBuffer(uint32_t addr, const uint8_t* buffer, size_t length) {
        if (addr + length > 131072) length = 131072 - addr;
        digitalWrite(csPin, LOW);
        SPI.transfer(0x02);
        SPI.transfer((addr >> 16) & 0xFF);
        SPI.transfer((addr >> 8) & 0xFF);
        SPI.transfer(addr & 0xFF);
        for (size_t i = 0; i < length; i++) {
            SPI.transfer(buffer[i]);
        }
        digitalWrite(csPin, HIGH);
        delayMicroseconds(length);  // Wait for writes
    }
    
    size_t getSize() const { return 131072; }
};

// MCP23S17 GPIO Expander Driver
class MCP23S17 {
    uint8_t csPin;
    uint8_t irqPin;
public:
    MCP23S17(uint8_t cs, uint8_t irq = 255) : csPin(cs), irqPin(irq) {
        pinMode(csPin, OUTPUT);
        digitalWrite(csPin, HIGH);
        if (irqPin != 255) {
            pinMode(irqPin, INPUT_PULLUP);
        }
    }
    
    void begin() {
        // Initialize MCP23S17
        // Configure I/O direction, pull-ups, etc.
        writeRegister(0x00, 0x0000);  // IODIRA - all outputs
        writeRegister(0x01, 0x0000);  // IODIRB - all outputs
        writeRegister(0x0C, 0x0000);  // GPPUA - no pull-ups
        writeRegister(0x0D, 0x0000);  // GPPUB - no pull-ups
        delay(10);
    }
    
    void pinMode(uint8_t pin, uint8_t mode) {
        uint16_t reg = readRegister(pin < 8 ? 0x00 : 0x01);  // IODIRA or IODIRB
        if (mode == OUTPUT) {
            reg &= ~(1 << (pin % 8));
        } else {
            reg |= (1 << (pin % 8));
        }
        writeRegister(pin < 8 ? 0x00 : 0x01, reg);
    }
    
    void digitalWrite(uint8_t pin, uint8_t value) {
        uint16_t reg = readRegister(pin < 8 ? 0x12 : 0x13);  // GPIOA or GPIOB
        if (value == HIGH) {
            reg |= (1 << (pin % 8));
        } else {
            reg &= ~(1 << (pin % 8));
        }
        writeRegister(pin < 8 ? 0x12 : 0x13, reg);
    }
    
    uint8_t digitalRead(uint8_t pin) {
        uint16_t reg = readRegister(pin < 8 ? 0x12 : 0x13);  // GPIOA or GPIOB
        return (reg >> (pin % 8)) & 0x01;
    }
    
    void pullUp(uint8_t pin, bool enable) {
        uint16_t reg = readRegister(pin < 8 ? 0x0C : 0x0D);  // GPPUA or GPPUB
        if (enable) {
            reg |= (1 << (pin % 8));
        } else {
            reg &= ~(1 << (pin % 8));
        }
        writeRegister(pin < 8 ? 0x0C : 0x0D, reg);
    }
    
    bool getInterrupt() {
        if (irqPin == 255) return false;
        return digitalRead(irqPin) == LOW;
    }
    
private:
    uint16_t readRegister(uint8_t reg) {
        digitalWrite(csPin, LOW);
        SPI.transfer(0x41);  // Read register command
        SPI.transfer(reg);
        uint8_t low = SPI.transfer(0);
        uint8_t high = SPI.transfer(0);
        digitalWrite(csPin, HIGH);
        return (high << 8) | low;
    }
    
    void writeRegister(uint8_t reg, uint16_t value) {
        digitalWrite(csPin, LOW);
        SPI.transfer(0x40);  // Write register command
        SPI.transfer(reg);
        SPI.transfer(value & 0xFF);
        SPI.transfer((value >> 8) & 0xFF);
        digitalWrite(csPin, HIGH);
    }
};

// TFT ST7789 Driver (Simplified)
class TFT_ST7789 {
    uint8_t csPin;
    uint8_t dcPin;
    uint8_t rstPin;
    uint16_t width;
    uint16_t height;
public:
    TFT_ST7789(uint8_t cs, uint8_t dc, uint8_t rst, 
               uint16_t w = 320, uint16_t h = 240)
        : csPin(cs), dcPin(dc), rstPin(rst), width(w), height(h) {
        pinMode(csPin, OUTPUT);
        pinMode(dcPin, OUTPUT);
        if (rstPin != 255) {
            pinMode(rstPin, OUTPUT);
        }
        digitalWrite(csPin, HIGH);
        digitalWrite(dcPin, HIGH);
        if (rstPin != 255) {
            digitalWrite(rstPin, HIGH);
        }
    }
    
