genose/genose.org-ESP8266-KernelonSDCard-GUIKit-TFT-Touch-WebDavServer/src/examples/esp8266_expander_ram_tft.cpp
    void begin() {
        // Hardware reset
        if (rstPin != 255) {
            digitalWrite(rstPin, LOW);
            delay(10);
            digitalWrite(rstPin, HIGH);
            delay(100);
        }
        
        // Software reset
        sendCommand(0x01);
        delay(150);
        
        // Initialize display
        sendCommand(0x11);  // Sleep out
        delay(250);
        
        sendCommand(0x36);  // Memory Data Access Control
        sendData(0x00);     // Portrait orientation
        
        sendCommand(0x3A);  // COLMOD: Pixel Format Set
        sendData(0x05);     // 16-bit color
        
        sendCommand(0x21);  // Display Inversion On
        
        sendCommand(0x13);  // Normal Display Mode On
        delay(10);
        
        sendCommand(0x29);  // Display On
        delay(100);
        
        fillScreen(0x0000);  // Clear screen
    }
    
    void sendCommand(uint8_t cmd) {
        digitalWrite(csPin, LOW);
        digitalWrite(dcPin, LOW);
        SPI.transfer(cmd);
        digitalWrite(csPin, HIGH);
    }
    
    void sendData(uint8_t data) {
        digitalWrite(csPin, LOW);
        digitalWrite(dcPin, HIGH);
        SPI.transfer(data);
        digitalWrite(csPin, HIGH);
    }
    
    void write16(uint16_t data) {
        sendData(data >> 8);
        sendData(data & 0xFF);
    }
    
    void setAddrWindow(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1) {
        sendCommand(0x2A);  // Column Address Set
        write16(x0);
        write16(x1);
        
        sendCommand(0x2B);  // Row Address Set
        write16(y0);
        write16(y1);
        
        sendCommand(0x2C);  // Memory Write
    }
    
    void fillScreen(uint16_t color) {
        setAddrWindow(0, 0, width - 1, height - 1);
        digitalWrite(csPin, LOW);
        digitalWrite(dcPin, HIGH);
        for (uint32_t i = 0; i < (uint32_t)width * height; i++) {
            SPI.transfer(color >> 8);
            SPI.transfer(color & 0xFF);
        }
        digitalWrite(csPin, HIGH);
    }
    
    void drawPixel(int16_t x, int16_t y, uint16_t color) {
        if (x < 0 || x >= width || y < 0 || y >= height) return;
        
        setAddrWindow(x, y, x, y);
        digitalWrite(csPin, LOW);
        digitalWrite(dcPin, HIGH);
        SPI.transfer(color >> 8);
        SPI.transfer(color & 0xFF);
        digitalWrite(csPin, HIGH);
    }
    
    void drawRect(int16_t x, int16_t y, int16_t w, int16_t h, uint16_t color) {
        if (w <= 0 || h <= 0) return;
        
        setAddrWindow(x, y, x + w - 1, y + h - 1);
        digitalWrite(csPin, LOW);
        digitalWrite(dcPin, HIGH);
        for (int32_t i = 0; i < (int32_t)w * h; i++) {
            SPI.transfer(color >> 8);
            SPI.transfer(color & 0xFF);
        }
        digitalWrite(csPin, HIGH);
    }
    
    uint16_t getWidth() const { return width; }
    uint16_t getHeight() const { return height; }
};

// ============================================================================
// Configuration Definitions
// ============================================================================

// Union-based config definition
const guikit_hw_config_union_t ESP8266_EXPANDER_RAM_TFT_CONFIG = {
    .is_esp8266 = true,
    .is_esp32 = false,
    
    .bank_count = 3,
    .banks = {
        // 1. 23LC1024 SRAM (128KB) on CS=D0 (GPIO16)
        {
            .device_type = GUIKIT_DEVICE_RAM_SRAM,
            .enabled = true,
            .config.ram = {
                .type = GUIKIT_RAM_SRAM,
                .size = 131072,  // 128KB
                .cs_pin = SRAM_CS_PIN
            },
            .name = "External SRAM"
        },
        
        // 2. MCP23S17 GPIO Expander on CS=D2 (GPIO4)
        {
            .device_type = GUIKIT_DEVICE_SPI_EXPANDER,
            .enabled = true,
            .config.spi_expander = {
                .type = GUIKIT_EXPANDER_MCP23S17,
                .cs_pin = EXPANDER_CS_PIN,
                .irq_pin = EXPANDER_IRQ_PIN,
                .reset_pin = 255  // Not used
            },
            .name = "GPIO Expander"
        },
        
        // 3. TFT Display on CS=D8 (GPIO15)
        {
            .device_type = GUIKIT_DEVICE_TFT,
            .enabled = true,
            .config.spi_device = {
                .type = GUIKIT_DEVICE_TFT,
                .cs_pin = TFT_CS_PIN,
                .irq_pin = 255,  // Not used
                .speed_mhz = SPI_MAX_SPEED_MHZ
            },
            .name = "TFT Display"
        }
    },
    
    .sck_pin = SPI_SCK_PIN,
    .mosi_pin = SPI_MOSI_PIN,
    .miso_pin = SPI_MISO_PIN,
    .max_speed_mhz = SPI_MAX_SPEED_MHZ,
    
    .display = {
        .width = 320,
        .height = 240,
        .color_depth = 4,  // 4bpp = 16 colors
        .double_buffer = false
    },
    
    .use_sd_card = false,
    .use_webdav = false,
    .debug_mode = true
};

// Simple config definition
const guikit_hw_config_t ESP8266_EXPANDER_RAM_TFT_CONFIG_SIMPLE = {
    .is_esp8266 = true,
    .is_esp32 = false,
    
    .ram = {
        .internal = true,
        .bank_count = 1,
        .bank = {
            {GUIKIT_RAM_SRAM, 131072, SRAM_CS_PIN, true}
        }
    },
    
    .spi = {
        .expander = true,
        .bank_count = 3,
        .bank = {
            {GUIKIT_SPI_DEVICE, GUIKIT_EXPANDER_NONE, TFT_CS_PIN, 255, true},    // TFT
            {GUIKIT_SPI_EXPANDER, GUIKIT_EXPANDER_MCP23S17, EXPANDER_CS_PIN, EXPANDER_IRQ_PIN, true}, // Expander
            {GUIKIT_SPI_DEVICE, GUIKIT_EXPANDER_NONE, SRAM_CS_PIN, 255, true}    // SRAM as SPI device
        },
        .sck_pin = SPI_SCK_PIN,
        .mosi_pin = SPI_MOSI_PIN,
        .miso_pin = SPI_MISO_PIN,
        .max_speed_mhz = SPI_MAX_SPEED_MHZ,
        .shared_bus = true
    },
    
    .display = {320, 240, 4, false},
    .use_sd_card = false,
    .use_webdav = false,
    .debug_mode = true
};

// Individual configs
const tft_config_t ESP8266_TFT_CONFIG = {
    .cs_pin = TFT_CS_PIN,
    .dc_pin = TFT_DC_PIN,
    .rst_pin = TFT_RST_PIN,
    .width = 320,
    .height = 240,
    .color_depth = 4,
    .double_buffer = false
};

const sram_config_t ESP8266_SRAM_CONFIG = {
    .cs_pin = SRAM_CS_PIN,
    .size_bytes = 131072,  // 128KB
    .spi_bus = 0
};

const expander_config_t ESP8266_EXPANDER_CONFIG = {
    .cs_pin = EXPANDER_CS_PIN,
    .irq_pin = EXPANDER_IRQ_PIN,
    .reset_pin = 255,  // Not used
    .gpio_count = 16    // MCP23S17 has 16 GPIO pins
};

