genose/genose.org-ESP8266-KernelonSDCard-GUIKit-TFT-Touch-WebDavServer/src/examples/esp8266_expander_ram_tft.cpp
const esp8266_hardware_config_t ESP8266_FULL_CONFIG = {
    .tft = ESP8266_TFT_CONFIG,
    .sram = ESP8266_SRAM_CONFIG,
    .expander = ESP8266_EXPANDER_CONFIG,
    
    .sck_pin = SPI_SCK_PIN,
    .mosi_pin = SPI_MOSI_PIN,
    .miso_pin = SPI_MISO_PIN,
    .max_speed_mhz = SPI_MAX_SPEED_MHZ,
    
    .use_sd_card = false,
    .use_webdav = false,
    .debug_mode = true
};

// ============================================================================
// Hardware Initialization
// ============================================================================

// Global device instances
SPISRAM* sram = nullptr;
MCP23S17* expander = nullptr;
TFT_ST7789* tft = nullptr;

/**
 * Initialize all hardware devices from the union-based configuration
 */
void initHardwareFromUnionConfig() {
    Serial.println("Initializing hardware from union config...");
    
    // Initialize SPI bus first
    SPI.begin();
    SPI.setFrequency(ESP8266_EXPANDER_RAM_TFT_CONFIG.max_speed_mhz * 1000000);
    SPI.setDataMode(SPI_MODE0);
    Serial.println("SPI bus initialized");
    
    // Initialize each device based on its type
    for (int i = 0; i < ESP8266_EXPANDER_RAM_TFT_CONFIG.bank_count; i++) {
        const guikit_device_bank_t* bank = &ESP8266_EXPANDER_RAM_TFT_CONFIG.banks[i];
        
        if (GUIKIT_BANK_IS_RAM(*bank)) {
            const guikit_ram_config_t* ram = guikit_bank_get_ram(bank);
            sram = new SPISRAM(ram->cs_pin);
            sram->begin();
            Serial.print("  SRAM initialized on CS=");
            Serial.print(ram->cs_pin);
            Serial.print(", Size: ");
            Serial.print(ram->size / 1024);
            Serial.println(" KB");
        }
        else if (GUIKIT_BANK_IS_SPI_EXPANDER(*bank)) {
            const guikit_spi_expander_config_t* exp = guikit_bank_get_spi_expander(bank);
            expander = new MCP23S17(exp->cs_pin, exp->irq_pin);
            expander->begin();
            Serial.print("  MCP23S17 initialized on CS=");
            Serial.println(exp->cs_pin);
        }
        else if (GUIKIT_BANK_IS_SPI_DEVICE(*bank)) {
            const guikit_spi_device_config_t* dev = guikit_bank_get_spi_device(bank);
            if (dev->type == GUIKIT_DEVICE_TFT) {
                tft = new TFT_ST7789(dev->cs_pin, TFT_DC_PIN, TFT_RST_PIN);
                tft->begin();
                Serial.print("  TFT initialized on CS=");
                Serial.println(dev->cs_pin);
            }
        }
    }
    
    Serial.println("All hardware initialized successfully");
}

/**
 * Initialize all hardware devices from the simple configuration
 */
void initHardwareFromSimpleConfig() {
    Serial.println("Initializing hardware from simple config...");
    
    // Initialize SPI bus
    SPI.begin();
    SPI.setFrequency(ESP8266_EXPANDER_RAM_TFT_CONFIG_SIMPLE.spi.max_speed_mhz * 1000000);
    SPI.setDataMode(SPI_MODE0);
    
    // Initialize SRAM from RAM config
    if (ESP8266_EXPANDER_RAM_TFT_CONFIG_SIMPLE.ram.bank_count > 0) {
        sram = new SPISRAM(ESP8266_EXPANDER_RAM_TFT_CONFIG_SIMPLE.ram.bank[0].cs_pin);
        sram->begin();
        Serial.print("  SRAM initialized on CS=");
        Serial.println(ESP8266_EXPANDER_RAM_TFT_CONFIG_SIMPLE.ram.bank[0].cs_pin);
    }
    
    // Initialize TFT and Expander from SPI config
    for (int i = 0; i < ESP8266_EXPANDER_RAM_TFT_CONFIG_SIMPLE.spi.bank_count; i++) {
        const guikit_spi_bank_t* bank = &ESP8266_EXPANDER_RAM_TFT_CONFIG_SIMPLE.spi.bank[i];
        
        if (bank->type == GUIKIT_SPI_DEVICE && bank->cs_pin == TFT_CS_PIN) {
            tft = new TFT_ST7789(bank->cs_pin, TFT_DC_PIN, TFT_RST_PIN);
            tft->begin();
            Serial.print("  TFT initialized on CS=");
            Serial.println(bank->cs_pin);
        }
        else if (bank->type == GUIKIT_SPI_EXPANDER) {
            expander = new MCP23S17(bank->cs_pin, bank->irq_pin);
            expander->begin();
            Serial.print("  MCP23S17 initialized on CS=");
            Serial.println(bank->cs_pin);
        }
    }
    
    Serial.println("All hardware initialized successfully");
}

/**
 * Initialize using individual configurations
 */
void initHardwareFromIndividualConfigs() {
    Serial.println("Initializing hardware from individual configs...");
    
    // Initialize SPI bus
    SPI.begin();
    SPI.setFrequency(ESP8266_FULL_CONFIG.max_speed_mhz * 1000000);
    SPI.setDataMode(SPI_MODE0);
    
    // Initialize SRAM
    sram = new SPISRAM(ESP8266_FULL_CONFIG.sram.cs_pin);
    sram->begin();
    Serial.print("  SRAM initialized on CS=");
    Serial.println(ESP8266_FULL_CONFIG.sram.cs_pin);
    
    // Initialize TFT
    tft = new TFT_ST7789(
        ESP8266_FULL_CONFIG.tft.cs_pin,
        ESP8266_FULL_CONFIG.tft.dc_pin,
        ESP8266_FULL_CONFIG.tft.rst_pin
    );
    tft->begin();
    Serial.print("  TFT initialized on CS=");
    Serial.println(ESP8266_FULL_CONFIG.tft.cs_pin);
    
    // Initialize Expander
    expander = new MCP23S17(
        ESP8266_FULL_CONFIG.expander.cs_pin,
        ESP8266_FULL_CONFIG.expander.irq_pin
    );
    expander->begin();
    Serial.print("  MCP23S17 initialized on CS=");
    Serial.println(ESP8266_FULL_CONFIG.expander.cs_pin);
    
    Serial.println("All hardware initialized successfully");
}

// ============================================================================
// Hardware Test Functions
// ============================================================================

/**
 * Test all initialized hardware
 */
void testHardware() {
    if (sram) {
        Serial.println("Testing SRAM...");
        // Write test pattern
        sram->write(0, 0xAA);
        sram->write(1, 0x55);
        sram->write(2, 0x0F);
        sram->write(3, 0xF0);
        
        // Read back and verify
        if (sram->read(0) == 0xAA &&
            sram->read(1) == 0x55 &&
            sram->read(2) == 0x0F &&
            sram->read(3) == 0xF0) {
            Serial.println("  SRAM test: PASS");
        } else {
            Serial.println("  SRAM test: FAIL");
        }
    }
    
    if (expander) {
        Serial.println("Testing MCP23S17...");
        // Configure pin 0 as output
        expander->pinMode(0, OUTPUT);
        
        // Test writing HIGH
        expander->digitalWrite(0, HIGH);
        if (expander->digitalRead(0) == HIGH) {
            Serial.println("  Expander pin 0 write HIGH: PASS");
        } else {
            Serial.println("  Expander pin 0 write HIGH: FAIL");
        }
        
        // Test writing LOW
        expander->digitalWrite(0, LOW);
        if (expander->digitalRead(0) == LOW) {
            Serial.println("  Expander pin 0 write LOW: PASS");
        } else {
            Serial.println("  Expander pin 0 write LOW: FAIL");
        }
        
        // Configure pin 1 as input with pull-up
        expander->pinMode(1, INPUT);
        expander->pullUp(1, true);
        delay(1);
        if (expander->digitalRead(1) == HIGH) {
            Serial.println("  Expander pin 1 pull-up: PASS");
        } else {
            Serial.println("  Expander pin 1 pull-up: FAIL");
        }
    }
    
    if (tft) {
        Serial.println("Testing TFT...");
        
        // Clear screen
        tft->fillScreen(0x0000);
        
