genose/genose.org-ESP8266-KernelonSDCard-GUIKit-TFT-Touch-WebDavServer/src/examples/esp8266_expander_ram_tft.cpp
        // Draw colored rectangles
        tft->drawRect(0, 0, 40, 40, 0xF800);    // Red
        tft->drawRect(40, 0, 40, 40, 0x07E0);   // Green
        tft->drawRect(80, 0, 40, 40, 0x001F);   // Blue
        
        // Draw a pixel
        tft->drawPixel(120, 20, 0xFFFF);       // White
        
        Serial.println("  TFT test: PASS (visual check required)");
    }
}

// ============================================================================
// Memory Management Example
// ============================================================================

// Framebuffer in external SRAM
#define FRAMEBUFFER_ADDR 0
#define FRAMEBUFFER_SIZE (320 * 240 * 4 / 8)  // 4bpp: 37.5 KB

/**
 * Draw to framebuffer in SRAM, then flush to TFT
 */
void drawFramebufferToTFT() {
    if (!sram || !tft) return;
    
    // For demonstration, just clear the framebuffer in SRAM
    uint8_t clearBuffer[FRAMEBUFFER_SIZE] = {0};
    sram->writeBuffer(FRAMEBUFFER_ADDR, clearBuffer, FRAMEBUFFER_SIZE);
    
    // In a real implementation, you would:
    // 1. Render to framebuffer in SRAM
    // 2. Read from SRAM and write to TFT
    // For now, just clear the TFT directly
    tft->fillScreen(0x0000);
}

/**
 * Store data in external SRAM
 */
void storeInSRAM(uint32_t addr, const uint8_t* data, size_t length) {
    if (sram && addr + length <= sram->getSize()) {
        sram->writeBuffer(addr, data, length);
    }
}

/**
 * Retrieve data from external SRAM
 */
void retrieveFromSRAM(uint32_t addr, uint8_t* buffer, size_t length) {
    if (sram && addr + length <= sram->getSize()) {
        sram->readBuffer(addr, buffer, length);
    }
}

// ============================================================================
// GPIO Expander Usage Example
// ============================================================================

/**
 * Example: Use expander GPIO for buttons
 */
void setupExpanderGPIO() {
    if (!expander) return;
    
    // Configure pins 0-7 as inputs with pull-ups (buttons)
    for (int i = 0; i < 8; i++) {
        expander->pinMode(i, INPUT);
        expander->pullUp(i, true);
    }
    
    // Configure pins 8-15 as outputs (LEDs)
    for (int i = 8; i < 16; i++) {
        expander->pinMode(i, OUTPUT);
        expander->digitalWrite(i, LOW);
    }
}

/**
 * Read button states from expander
 */
uint16_t readExpanderButtons() {
    if (!expander) return 0;
    
    uint16_t buttons = 0;
    for (int i = 0; i < 8; i++) {
        if (expander->digitalRead(i) == LOW) {  // Pressed (pull-up)
            buttons |= (1 << i);
        }
    }
    return buttons;
}

/**
 * Set LED states on expander
 */
void setExpanderLEDs(uint16_t ledStates) {
    if (!expander) return;
    
    for (int i = 8; i < 16; i++) {
        expander->digitalWrite(i, (ledStates >> (i - 8)) & 0x01);
    }
}

// ============================================================================
// Main Setup and Loop
// ============================================================================

void setup() {
    Serial.begin(115200);
    while (!Serial);
    
    Serial.println("ESP8266 + MCP23S17 + 23LC1024 + TFT Example");
    Serial.println("==========================================");
    
    // Choose one initialization method:
    // initHardwareFromUnionConfig();
    // initHardwareFromSimpleConfig();
    initHardwareFromIndividualConfigs();
    
    // Run hardware tests
    testHardware();
    
    // Setup expander GPIO
    setupExpanderGPIO();
    
    // Clear TFT
    if (tft) {
        tft->fillScreen(0x0000);
    }
    
    Serial.println("\nSetup complete!");
}

void loop() {
    static uint8_t ledState = 0;
    
    // Read buttons
    uint16_t buttons = readExpanderButtons();
    if (buttons != 0) {
        Serial.print("Buttons pressed: 0x");
        Serial.println(buttons, HEX);
        
        // Toggle LEDs based on button press
        ledState ^= 0xFF;
        setExpanderLEDs(ledState);
    }
    
    // Simple animation
    if (tft) {
        static int x = 0;
        tft->drawPixel(x, 100, 0xFFFF);
        x++;
        if (x >= tft->getWidth()) x = 0;
    }
    
    delay(10);
}
